ningdaoxiao/stm32F030_RTX5/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCU_005R_SEL_Pin GPIO_PIN_0
#define MCU_005R_SEL_GPIO_Port GPIOF
#define MCU_DCDC_EN_Pin GPIO_PIN_1
#define MCU_DCDC_EN_GPIO_Port GPIOF
#define MCU_BAT_ADC_Pin GPIO_PIN_0
#define MCU_BAT_ADC_GPIO_Port GPIOA
#define MCU_PWR_ON_Pin GPIO_PIN_1
#define MCU_PWR_ON_GPIO_Port GPIOA
#define MCU_SYS_LED_Pin GPIO_PIN_4
#define MCU_SYS_LED_GPIO_Port GPIOA
#define MCU_KEY_IN3_Pin GPIO_PIN_5
#define MCU_KEY_IN3_GPIO_Port GPIOA
#define MCU_KEY_IN2_Pin GPIO_PIN_6
#define MCU_KEY_IN2_GPIO_Port GPIOA
#define MCU_KEY_IN1_Pin GPIO_PIN_7
#define MCU_KEY_IN1_GPIO_Port GPIOA
#define MCU_PWR_KEY_Pin GPIO_PIN_1
#define MCU_PWR_KEY_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
